In [1]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter(action='ignore',category=np.VisibleDeprecationWarning)

## Review

From your homework: 

> *Below we load ... 200,000 weekday Uber rides in the ...  Boston, Massachusetts metropolitan area from the [Uber Movement](https://www.uber.com/newsroom/introducing-uber-movement-2/) project. The `sourceid` and `dstid` columns contain codes corresponding to start and end locations of each ride. The `hod` column contains codes corresponding to the hour of the day the ride took place. The `ride time` column contains the length of the ride in minutes.*

In [10]:
boston = Table.read_table("boston.csv")
boston.show(6)

**Discussion Question:** I would like to add a column to this dataset giving the ride time in seconds. 

What is a method that makes the most sense:

- If I plan to work with only the `boston` dataset?
- If I plan to work with multiple Uber Movement datasets, such as the `manila` dataset you saw in your homework?

## New material

### One-column groups

In [120]:
cones = Table.read_table('cones.csv')
cones_without_color = cones.drop('Color')

In [16]:
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [119]:
cones_without_color.group('Flavor')

Flavor     | count
bubblegum  | 1
chocolate  | 3
strawberry | 2

In [118]:
cones_without_color.group('Flavor', min)

Flavor     | Price min
bubblegum  | 4.75
chocolate  | 4.75
strawberry | 3.55

### Two-column groups

In [117]:
cones.group(['Flavor','Color'])

Flavor     | Color       | count
bubblegum  | pink        | 1
chocolate  | dark brown  | 2
chocolate  | light brown | 1
strawberry | pink        | 2

In [116]:
cones.group(['Flavor','Color'], max)

Flavor     | Color       | Price max
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
strawberry | pink        | 5.25

______

### Advanced grouping

#### `welcome_survey` dataset

In [115]:
survey = Table.read_table('welcome_survey_sp24.csv')
underclassmen = make_array('First Year','Second Year', 'Third Year','Fourth Year')
survey = survey.where('Year', are.contained_in(underclassmen))
survey.show(5)

**Discussion Question 2**: How many rows and how many columns will the table be that is produced by the following code?

In [48]:
survey.group('Year')

Year        | count
First Year  | 470
Fourth Year | 49
Second Year | 220
Third Year  | 191

**Discussion Question 3**: How many rows and how many columns will the table be that is produced by the following code?

In [49]:
survey.group('Year', np.average)

Year        | Extraversion average | Number of textees average | Hours of sleep average | Handedness average | Sleep position average | Pets average | TV average | Piercings average
First Year  | 5.69574              | 7.58723                   | 7.12872                |                    |                        |              |            | 1.68936
Fourth Year | 5.40816              | 6.59184                   | 7.09184                |                    |                        |              |            | 2.08163
Second Year | 5.49545              | 6.59545                   | 6.91591                |                    |                        |              |            | 2.46818
Third Year  | 5.12565              | 5.48691                   | 7.02094                |                    |                        |              |            | 3.08901

In [63]:
survey.drop('Handedness', 'Sleep position', 'Pets', 'TV').group('Year', np.average)

Year        | Extraversion average | Number of textees average | Hours of sleep average | Piercings average
First Year  | 5.69574              | 7.58723                   | 7.12872                | 1.68936
Fourth Year | 5.40816              | 6.59184                   | 7.09184                | 2.08163
Second Year | 5.49545              | 6.59545                   | 6.91591                | 2.46818
Third Year  | 5.12565              | 5.48691                   | 7.02094                | 3.08901

### `nba_salaries` dataset

In [61]:
nba = Table.read_table("nba_salaries.csv")
nba.show(6)

#### **Task**: Find the five teams paying the highest average salary (in millions) in 2010 and in 2010.
- Your results should be in the form of a table with 5 rows and 2 columns:
    - One column should have the team name
    - The other column should have the salary for that team, in millions.
- You should only have to use `Table.select()` or `Table.drop()` *once*.

In [95]:
def average_in_millions(x):
    average = np.average(x)
    return average/1e6

In [98]:
salary_table_2020 = nba.where('season', 2020).select('team', 
                                 'salary').group('team', average_in_millions)

In [99]:
salary_table_2020.sort(1, descending=True).show(5)

#### **Challenge Task:** Find the $n$ teams paying the highest average salary (in millions) in season $y$.
- In other words, write code that will produce the table you made above, but for any given $n$ and $y$.

In [107]:
def highest_paying_teams(y, n):
    salary_table = nba.where('season', y).select('team', 
                                 'salary').group('team', average_in_millions)
    return salary_table.sort(1, descending=True).show(n)

In [112]:
highest_paying_teams(2016,3)